1.
¿Qué diferencia hay entre una Serie y un DataFrame?

una serie es un array unidimensional y tiene indices y dataframe es un array bidimensional

In [1]:
import numpy as np

In [2]:
#2 Crea un array de dos dimensiones con 4 filas y 3 columnas.

b2 = np.random.randint(1,100, (4,3))
b2

array([[83, 30, 34],
       [ 9, 15, 91],
       [79, 84, 14],
       [80, 10, 54]])

In [3]:
import pandas as pd

In [4]:
# 3 Convierte el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

df = pd.DataFrame(b2)
df

    0   1   2
0  83  30  34
1   9  15  91
2  79  84  14
3  80  10  54

In [5]:
df = pd.DataFrame(b2, columns=["España", "Francia", "Italia"])
df

   España  Francia  Italia
0      83       30      34
1       9       15      91
2      79       84      14
3      80       10      54

In [6]:
#4  Usando el loc extrae todas las columnas de la fila de Tailandia usando archivo medallas

medallas = pd.read_csv("medallas.csv", index_col=0)
medallas

               País   Oro  Plata  Bronce
1             China  1473    994     720
2             Japón  1032   1037     985
3     Corea del Sur   745    663     827
4              Irán   179    181     197
5        Kazajistán   155    158     224
6             India   154    202     315
7         Tailandia   132    175     278
8         Indonesia   112    131     240
9      China Taipéi    99    144     276
10  Corea del Norte    91    120     235

In [7]:
medallas.loc[7]

# buscamos por 7 porque es la etiqueta de Tailandia y así es suficiente para extraer el resto de la data. No es necesario incluir los nombres de las cols.

País      Tailandia
Oro             132
Plata           175
Bronce          278
Name: 7, dtype: object

In [8]:
# 5 Usando el loc extrae todas las columnas de China e Irán.

medallas.loc[[1,4]]

    País   Oro  Plata  Bronce
1  China  1473    994     720
4   Irán   179    181     197

In [9]:
#6 Usando el loc extrae solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

medallas.loc[[1,4],["Oro", "Plata", "Bronce"]]

    Oro  Plata  Bronce
1  1473    994     720
4   179    181     197

In [10]:
medallas

               País   Oro  Plata  Bronce
1             China  1473    994     720
2             Japón  1032   1037     985
3     Corea del Sur   745    663     827
4              Irán   179    181     197
5        Kazajistán   155    158     224
6             India   154    202     315
7         Tailandia   132    175     278
8         Indonesia   112    131     240
9      China Taipéi    99    144     276
10  Corea del Norte    91    120     235

In [11]:
#7 Usando el iloc extrae la información de la India. Devolved todas las columnas.

medallas.iloc[5]

País      India
Oro         154
Plata       202
Bronce      315
Name: 6, dtype: object

In [12]:
# 8 Usando el iloc extrae todas las columnas de los países que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.

medallas.iloc[1:10:1]

               País   Oro  Plata  Bronce
2             Japón  1032   1037     985
3     Corea del Sur   745    663     827
4              Irán   179    181     197
5        Kazajistán   155    158     224
6             India   154    202     315
7         Tailandia   132    175     278
8         Indonesia   112    131     240
9      China Taipéi    99    144     276
10  Corea del Norte    91    120     235

In [13]:
# 9 Utilizando el código del ejercicio anterior, selecciona unicamente las columnas "Oro", "Plata" y "Bronce".

medallas.iloc[1:10:1],["Oro", "Plata", "Bronce"]

(               País   Oro  Plata  Bronce
 2             Japón  1032   1037     985
 3     Corea del Sur   745    663     827
 4              Irán   179    181     197
 5        Kazajistán   155    158     224
 6             India   154    202     315
 7         Tailandia   132    175     278
 8         Indonesia   112    131     240
 9      China Taipéi    99    144     276
 10  Corea del Norte    91    120     235,
 ['Oro', 'Plata', 'Bronce'])

In [14]:
medallas

               País   Oro  Plata  Bronce
1             China  1473    994     720
2             Japón  1032   1037     985
3     Corea del Sur   745    663     827
4              Irán   179    181     197
5        Kazajistán   155    158     224
6             India   154    202     315
7         Tailandia   132    175     278
8         Indonesia   112    131     240
9      China Taipéi    99    144     276
10  Corea del Norte    91    120     235

In [19]:
medallas_oro = medallas.loc[medallas.Oro > 200, ["País","Oro"]]
medallas_oro

            País   Oro
1          China  1473
2          Japón  1032
3  Corea del Sur   745

In [ ]:
# 10 ¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?

medallas_oro_plata = medallas.loc[(medallas.Oro > 200) & (medallas.Plata > 1000), [ "Oro", "Plata"]]
medallas_oro_plata

    Oro  Plata
2  1032   1037

In [ ]:
# 👇 habiamos intentado resolverlo así pero las condiciones no estaban entre ()

medallas_oro_plata = medallas.loc[medallas.Oro > 200][medallas.Plata > 1000],["Oro","Plata"]
medallas_oro_plata

/var/folders/9v/j05cmf_x6rdgwt54wx5km8x00000gn/T/ipykernel_98871/3592900856.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  medallas_oro_plata = medallas.loc[medallas.Oro > 200][medallas.Plata > 1000],["Oro","Plata"]

(    País   Oro  Plata  Bronce
 2  Japón  1032   1037     985,
 ['Oro', 'Plata'])